9/data/attachments/bcb2b963339656de.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Derrick_cause_Friend_24954_8</nif:username>
            <nif:friendToBeRequested>soap_friends_b59bebe6-15b4-4d81-9415-b1a2745429cf</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>